n = int(input())

# Перший варіант
if n == 1:
    # Змінна-дічильник, що відображає кількість чисел, згідно умови
    count = 0
    # Ітеруємо по всім двозначним числам
    for i in range(10, 100):
        # Розбиваємо число на цифри 'd1', 'd0'
        d1 = i // 10
        d0 = i % 10
        # Перевіряємо чи цифри спадають
        if d0 < d1:
            # Якщо цифри спадають, додаємо до лічильника одиницю
            count += 1
    # Друкуємо результат
    print(count)

# Другий варіант
elif n == 2:
    count = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Якщо цифри зростають, додаємо до лічильника одиницю
        if d0 > d1:
            count += 1
    print(count)

# Третій варіант
elif n == 3:
    count = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Порівнюємо парність обох цифр
        if d0 % 2 == d1 % 2:
            count += 1
    print(count)

# Четвертий варіант
elif n == 4:
    # Змінна, в яку будемо зберігати суму, згідно умови
    s = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Порівнюємо цифри
        if d0 == d1:
            # Якщо цифри рівні, додаємо двозначне число до суми
            s += i
    # Друкуємо результат суми всіх двозначних чисел, що мають однакові цифри
    print(s)

# П`ятий варіант
elif n == 5:
    s = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Перевіряємо на парність обидві цифри
        if d0 % 2 == 0 and d1 % 2 == 0:
            s += i
    print(s)

# Шостий варіант
elif n == 6:
    s = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Перевіряємо на непарність обидві цифри
        if d0 % 2 == 1 and d1 % 2 == 1:
            s += i
    print(s)
