count = 0

# Встановлюємо нескінченний цикл
while True:
    # Зчитуємо число
    n = int(input())
    # Перевіряємо, чи дорівнює воно нулю. Якщо так, виходимо з циклу
    if n == 0:
        break
    # Якщо число не нуль, перевіряємо, чи воно парне
    # Якщо число парне, починаємо наступну ітерацію циклу,
    # тобто все, що йде після слова 'continue', не читається
    if n % 2 == 0:
        continue
    # Інакше, додаємо до лічильника одиницю
    count += 1

# Друкуємо результат - кількість успішно пройдених ітерацій циклу
print(count)
