import math

# Вводимо натуральне число
n = int(input())

# Число, до якого будемо ітерувати
# Ціла частина корня квадратного від 'n' плюс один
k = int(math.sqrt(n)) + 1
# Ітеруємо по можливим дільникам
# Ітерація проводиться саме до квадратного кореня , оскільки немає смислу
# перевіряти далі (згодом буде доведено відповідну теорему)
for i in range(2, k):
    # Якщо число 'n' ділиться на якесь число з відрізку [2, k]
    # друкуємо це значення і зупиняємо роботу циклу
    if n % i == 0:
        print(i)
        break
# У випадку успішного завершення циклу (тобто не виходом 'break'),
# можемо стверджувати, що число просте, тому друкуємо його
else:
    print(n)
